In [4]:
from matplotlib import pyplot as plt
import numpy as np
import pandas as pd
from scipy import stats

In [27]:
# import tables
df1 = pd.read_csv("test_table.csv")
user = pd.read_csv("user_table.csv")

In [31]:
# test_table dim: 453321*9
df1.shape
# user_table dim: 452867
user.shape
user.head()

   user_id sex  age    country
0   765821   M   20     Mexico
1   343561   F   27  Nicaragua
2   118744   M   23   Colombia
3   987753   F   27  Venezuela
4   554597   F   20      Spain

In [33]:
# no duplciated user_id
# that means when we left join user table, where would be some missing values for user information
# thus, we could avoid missing value by performing inner join
df1[df1.duplicated(['user_id'])]
user[user.duplicated(['user_id'])]
#both user_id are unique

Empty DataFrame
Columns: [user_id, sex, age, country]
Index: []

In [37]:
df2 = pd.merge(df1, user, how = 'inner', on = 'user_id')
df2.head()
#452867*12
df2.shape

(452867, 12)